In [19]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [20]:
import numpy as np
import pandas as pd

In [21]:
from agent.scalable_model import Scalable
from tics.tic_config import tics_176

In [22]:
tics = np.unique(tics_176).tolist()
train_start_date = '2009-01-01'
train_end_date = '2020-07-01'

In [23]:
model = Scalable(None, None)

In [24]:
model.train(tics, train_start_date, train_end_date)

In [25]:
[len(lst) for lst in model.tics_lst]

[31, 25, 35, 35, 25, 25]

In [30]:
model.tics_lst[0]

['ALNY',
 'AMD',
 'BA',
 'BIDU',
 'CAT',
 'CVLT',
 'CVX',
 'ERIC',
 'EXPE',
 'GEO',
 'GS',
 'HAS',
 'HEES',
 'IBM',
 'IDCC',
 'IMBBY',
 'JPM',
 'LBTYK',
 'MAR',
 'MRCY',
 'MSTR',
 'MU',
 'NTAP',
 'TCOM',
 'TDS',
 'TKO',
 'TMUS',
 'UAL',
 'USM',
 'WBA',
 'WDC']

In [27]:
model.data.head()

,date,close,high,low,open,volume,tic,day
0,2009-01-02,7.909601,8.480000,7.670000,7.730000,5167000,AAL,4
1,2009-01-02,2.730994,3.251429,3.041429,3.067143,746015200,AAPL,4
2,2009-01-02,23.020000,23.100000,21.070000,21.110001,6670700,ADBE,4
3,2009-01-02,13.315101,19.780001,18.760000,19.000000,3264900,ADI,4
4,2009-01-02,23.842716,35.548725,34.205444,34.784901,4021809,ADP,4